---
kind: method
id: M:Autodesk.Revit.UI.ProjectBrowserOptions.GetProjectBrowserOptions
source: html/a1b745b0-6c5a-42e3-4045-e87c038c1cd6.htm
---
# Autodesk.Revit.UI.ProjectBrowserOptions.GetProjectBrowserOptions Method

Returns the current Revit instance's ProjectBrowserOptions.

## Syntax (C#)
```csharp
public static ProjectBrowserOptions GetProjectBrowserOptions()
```

## Returns
The ProjectBrowserOptions for the current Revit instance.